Revit 2024 API
Schema.Lookup Method
 Finds the Schema corresponding to the GUID in memory.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static Schema Lookup(
	Guid guid
)
Visual Basic
Public Shared Function Lookup ( _
	guid As Guid _
) As Schema
Visual C++
public:
static Schema^ Lookup(
	Guid guid
)
Parameters
guid
Type: System.Guid
See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace